/*
1) Какие у вас ожидания от курса? Есть ли конкретные вопросы по теме Базы данных?
*/
-- Повысить свой знания в области баз данных.
-- Если вопросы появятся, то я обязательно задам.

/*
2) В какой сфере работаете сейчас?
*/
-- IT.

/*
3) Если в IT, то какой у вас опыт (инструменты, технологии, языки программирования)?
*/
-- Я работаю фронтенд разработчиком больше 10 лет.
-- JavaScript, Node.js, Vue.js, Angular, React, Jquery, Pug, Webpack ...
-- HTML, CSS, SASS, LESS
-- WebStorm, PyCharm, DataGrip